silpdev/cc-reminder-esp8266/firmware/src/main.cpp
/*
 * cc-reminder - ESP8266 (Wemos D1 Mini) + WS2812
 * Ban ROAMING: nho 3 mang WiFi, tu chon mang manh nhat, va tra loi
 * UDP discovery de host tim duoc IP o bat ky mang nao.
 *
 * Cam o nha hay o cong ty deu chay, khong phai cau hinh lai.
 *
 * DAU NOI
 *   strip VCC -> 3V3
 *   strip DIN -> D9 / RX (GPIO3 - bat buoc, DMA chi chay chan nay)
 *   strip GND -> G
 *
 * API
 *   GET  /                    trang cau hinh
 *   GET  /state?s=IDLE|WORKING|INTERACT
 *   GET  /status              ten trang thai, dang text
 *   GET  /api/status          JSON
 *   GET  /api/config          JSON cau hinh (khong co mat khau)
 *   POST /api/config          luu cau hinh
 *   GET  /api/scan            quet WiFi
 *   POST /api/reboot | /api/reset
 *
 * UDP DISCOVERY
 *   Host broadcast "CCR?" toi port 45678 -> thiet bi tra ve JSON co IP.
 *   Nho vay host khong phu thuoc mDNS (mDNS hay chet tren WSL).
 *
 * Sua HTML o firmware/web/page.html roi chay tools/embed_page.py.
 */

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <DNSServer.h>
#include <EEPROM.h>
#include <NeoPixelBus.h>

/* ===================== hang so ===================== */
#define MAX_PIXELS    24
#define NET_SLOTS     3
#define CFG_MAGIC     0x43524D34UL     // doi so = xoa cau hinh cu
#define AP_SSID       "cc-reminder-setup"
#define EEPROM_SIZE   512
#define DISCO_PORT    45678
#define DISCO_PROBE   "CCR?"
#define RECONNECT_MS  20000UL          // mat wifi bao lau thi quet lai

const uint8_t ST_IDLE     = 0;
const uint8_t ST_WORKING   = 1;
const uint8_t ST_INTERACT  = 2;

/* ===================== cau hinh ===================== */
struct Net {
  char ssid[33];
  char pass[65];
};

struct Config {
  uint32_t magic;
  Net      net[NET_SLOTS];
  char     host[24];
  uint8_t  pixels;
  uint8_t  bright;
  uint8_t  order;              // 0 = GRB (mac dinh), 1 = RGB
  uint8_t  col[3][3];
  uint8_t  pulse[3];
  uint16_t period[3];
};

Config cfg;

void setDefaults() {
  memset(&cfg, 0, sizeof(cfg));
  cfg.magic = CFG_MAGIC;
  strncpy(cfg.host, "cc-reminder", sizeof(cfg.host) - 1);
  cfg.pixels = 1;
  cfg.bright = 60;
  cfg.order  = 0;

  cfg.col[0][0] = 0;   cfg.col[0][1] = 255; cfg.col[0][2] = 0;   // IDLE
  cfg.pulse[0]  = 0;   cfg.period[0] = 2000;
  cfg.col[1][0] = 255; cfg.col[1][1] = 90;  cfg.col[1][2] = 0;   // WORKING
  cfg.pulse[1]  = 1;   cfg.period[1] = 2400;
  cfg.col[2][0] = 255; cfg.col[2][1] = 0;   cfg.col[2][2] = 0;   // INTERACT
  cfg.pulse[2]  = 1;   cfg.period[2] = 900;
}

void loadConfig() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.get(0, cfg);
  if (cfg.magic != CFG_MAGIC) {
    Serial.println("eeprom trong -> dung mac dinh");
    setDefaults();
    return;
  }
  if (cfg.pixels < 1 || cfg.pixels > MAX_PIXELS) cfg.pixels = 1;
  if (cfg.bright < 1) cfg.bright = 1;
  if (cfg.order > 1)  cfg.order = 0;
  for (uint8_t i = 0; i < 3; i++) {
    if (cfg.period[i] < 200)   cfg.period[i] = 900;
    if (cfg.period[i] > 10000) cfg.period[i] = 10000;
    if (cfg.pulse[i] > 1)      cfg.pulse[i] = 0;
  }
  for (uint8_t i = 0; i < NET_SLOTS; i++) {
    cfg.net[i].ssid[sizeof(cfg.net[i].ssid) - 1] = '\0';
    cfg.net[i].pass[sizeof(cfg.net[i].pass) - 1] = '\0';
  }
  cfg.host[sizeof(cfg.host) - 1] = '\0';
  if (cfg.host[0] == '\0') strncpy(cfg.host, "cc-reminder", sizeof(cfg.host) - 1);
}

void saveConfig() {
  cfg.magic = CFG_MAGIC;
  EEPROM.put(0, cfg);
  EEPROM.commit();
  Serial.println("eeprom da luu");
}

uint8_t netCount() {
  uint8_t n = 0;
  for (uint8_t i = 0; i < NET_SLOTS; i++) if (cfg.net[i].ssid[0]) n++;
  return n;
}

/* ===================== LED ===================== */
NeoPixelBus<NeoGrbFeature, NeoEsp8266Dma800KbpsMethod> strip(MAX_PIXELS);

uint8_t state = ST_IDLE;

void writeAll(uint8_t r, uint8_t g, uint8_t b) {
  // order == 1 (strip RGB): dao r/g vi feature dang la GRB
  RgbColor c = (cfg.order == 1) ? RgbColor(g, r, b) : RgbColor(r, g, b);
  for (uint16_t i = 0; i < MAX_PIXELS; i++) {
    strip.SetPixelColor(i, (i < cfg.pixels) ? c : RgbColor(0, 0, 0));
  }
  strip.Show();
}

float pulseK(uint16_t periodMs, float floorK) {
  if (periodMs < 1) periodMs = 1;
  float deg = (float)(millis() % periodMs) / (float)periodMs * 360.0f;
  float s = 0.5f - 0.5f * cos(deg * PI / 180.0f);
  return floorK + (1.0f - floorK) * s;
}

void renderLed() {
  static unsigned long last = 0;
  if (millis() - last < 20) return;
  last = millis();

  uint8_t s = state;
  float k = 1.0f;
  if (cfg.pulse[s]) k = pulseK(cfg.period[s], (s == ST_INTERACT) ? 0.15f : 0.40f);

  float bk = ((float)cfg.bright / 255.0f) * k;
  writeAll((uint8_t)(cfg.col[s][0] * bk),
           (uint8_t)(cfg.col[s][1] * bk),
           (uint8_t)(cfg.col[s][2] * bk));
}

/* ===================== web / udp ===================== */
ESP8266WebServer server(80);
DNSServer  dns;
WiFiUDP    disco;
bool apMode = false;
int  activeSlot = -1;

extern const char PAGE_HTML[] PROGMEM;

const char* stateName(uint8_t s) {
  if (s == ST_WORKING)  return "WORKING";
  if (s == ST_INTERACT) return "INTERACT";
  return "IDLE";
}

String jstr(const String& in) {
  String o = in;
  o.replace("\\", "\\\\");
  o.replace("\"", "\\\"");
  return o;
}

String hex3(const uint8_t* c) {
  char b[10];
  snprintf(b, sizeof(b), "#%02x%02x%02x", c[0], c[1], c[2]);
  return String(b);
}

bool parseHex3(const String& s, uint8_t* out) {
  if (s.length() < 7 || s.charAt(0) != '#') return false;
  for (uint8_t i = 0; i < 3; i++) {
    out[i] = (uint8_t)strtol(s.substring(1 + i * 2, 3 + i * 2).c_str(), NULL, 16);
  }
  return true;
}

/* ---- UDP discovery ---- */
void discoBegin() {
  disco.begin(DISCO_PORT);
  Serial.printf("udp discovery: port %d\n", DISCO_PORT);
}

void discoLoop() {
  int sz = disco.parsePacket();
  if (sz <= 0) return;

  char buf[32];
  int n = disco.read(buf, sizeof(buf) - 1);
  if (n < 0) n = 0;
  buf[n] = '\0';

  if (strncmp(buf, DISCO_PROBE, strlen(DISCO_PROBE)) != 0) return;

  String o = "{\"cc-reminder\":1,\"host\":\"";
  o += jstr(String(cfg.host));
  o += "\",\"ip\":\"";   o += WiFi.localIP().toString();
  o += "\",\"port\":80,\"state\":\""; o += stateName(state);
  o += "\"}";

  disco.beginPacket(disco.remoteIP(), disco.remotePort());
  disco.write((const uint8_t*)o.c_str(), o.length());
  disco.endPacket();
}

/* ---- handlers ---- */
void handleRoot() {
  server.send_P(200, "text/html", PAGE_HTML);
}

void handleApiStatus() {
  String o = "{";
  o += "\"state\":\"";  o += stateName(state); o += "\",";
  o += "\"ap\":";       o += (apMode ? "true" : "false"); o += ",";
  o += "\"slot\":";     o += activeSlot;       o += ",";
  o += "\"ssid\":\"";   o += jstr(WiFi.SSID()); o += "\",";
  o += "\"ip\":\"";     o += (apMode ? WiFi.softAPIP().toString()
                                     : WiFi.localIP().toString()); o += "\",";
  o += "\"host\":\"";   o += jstr(String(cfg.host)); o += "\",";
  o += "\"rssi\":";     o += WiFi.RSSI();      o += ",";
  o += "\"uptime\":";   o += (millis() / 1000); o += ",";
  o += "\"heap\":";     o += ESP.getFreeHeap();
  o += "}";
  server.send(200, "application/json", o);
}

void handleApiConfigGet() {
  String o = "{\"nets\":[";
  for (uint8_t i = 0; i < NET_SLOTS; i++) {
    if (i) o += ",";
    o += "{\"ssid\":\""; o += jstr(String(cfg.net[i].ssid));
    o += "\",\"saved\":"; o += (cfg.net[i].pass[0] ? "true" : "false");
    o += "}";
  }
  o += "],";
  o += "\"host\":\"";  o += jstr(String(cfg.host)); o += "\",";
  o += "\"pixels\":";  o += cfg.pixels; o += ",";
  o += "\"bright\":";  o += cfg.bright; o += ",";
  o += "\"order\":";   o += cfg.order;  o += ",";
  o += "\"col\":[";
  for (uint8_t i = 0; i < 3; i++) { o += "\""; o += hex3(cfg.col[i]); o += "\"";
                                    if (i < 2) o += ","; }
  o += "],\"pulse\":[";
  for (uint8_t i = 0; i < 3; i++) { o += cfg.pulse[i];  if (i < 2) o += ","; }
  o += "],\"period\":[";
  for (uint8_t i = 0; i < 3; i++) { o += cfg.period[i]; if (i < 2) o += ","; }
  o += "]}";
  server.send(200, "application/json", o);
}

void handleApiConfigPost() {
  bool needReboot = false;
  char key[8];

  for (uint8_t i = 0; i < NET_SLOTS; i++) {
    snprintf(key, sizeof(key), "ssid%u", i);
    if (server.hasArg(key)) {
      String v = server.arg(key);
      if (v != String(cfg.net[i].ssid)) {
        strncpy(cfg.net[i].ssid, v.c_str(), sizeof(cfg.net[i].ssid) - 1);
        cfg.net[i].ssid[sizeof(cfg.net[i].ssid) - 1] = '\0';
        if (v.length() == 0) cfg.net[i].pass[0] = '\0';   // xoa slot
        needReboot = true;
      }
    }
    // o trong = giu mat khau cu
    snprintf(key, sizeof(key), "pass%u", i);
    if (server.hasArg(key) && server.arg(key).length() > 0) {
      strncpy(cfg.net[i].pass, server.arg(key).c_str(), sizeof(cfg.net[i].pass) - 1);
      cfg.net[i].pass[sizeof(cfg.net[i].pass) - 1] = '\0';
      needReboot = true;
    }
  }

  if (server.hasArg("host")) {
    String v = server.arg("host");
    if (v.length() > 0 && v != String(cfg.host)) {
      strncpy(cfg.host, v.c_str(), sizeof(cfg.host) - 1);
      cfg.host[sizeof(cfg.host) - 1] = '\0';
      needReboot = true;
    }
  }
  if (server.hasArg("pixels")) {
    uint8_t v = (uint8_t)constrain(server.arg("pixels").toInt(), 1, MAX_PIXELS);
    if (v != cfg.pixels) { cfg.pixels = v; needReboot = true; }
  }
  if (server.hasArg("bright"))
    cfg.bright = (uint8_t)constrain(server.arg("bright").toInt(), 1, 255);
  if (server.hasArg("order"))
    cfg.order = (server.arg("order").toInt() == 1) ? 1 : 0;

  for (uint8_t i = 0; i < 3; i++) {
    snprintf(key, sizeof(key), "c%u", i);
    if (server.hasArg(key)) {
      uint8_t rgb[3];
      if (parseHex3(server.arg(key), rgb)) {
        cfg.col[i][0] = rgb[0]; cfg.col[i][1] = rgb[1]; cfg.col[i][2] = rgb[2];
      }
    }
    snprintf(key, sizeof(key), "p%u", i);
    if (server.hasArg(key)) cfg.pulse[i] = (server.arg(key).toInt() == 1) ? 1 : 0;
    snprintf(key, sizeof(key), "t%u", i);
    if (server.hasArg(key))
      cfg.period[i] = (uint16_t)constrain(server.arg(key).toInt(), 200, 10000);
  }

