silpdev/cc-reminder-esp8266/firmware/src/main.cpp
  saveConfig();
  String o = "{\"ok\":true,\"reboot\":";
  o += (needReboot ? "true" : "false");
  o += "}";
  server.send(200, "application/json", o);
}

void handleApiScan() {
  int n = WiFi.scanNetworks();
  String o = "[";
  for (int i = 0; i < n && i < 20; i++) {
    if (i) o += ",";
    o += "{\"ssid\":\""; o += jstr(WiFi.SSID(i));
    o += "\",\"rssi\":";  o += WiFi.RSSI(i);
    o += "}";
  }
  o += "]";
  server.send(200, "application/json", o);
}

void handleSetState() {
  String s = server.arg("s");
  s.toUpperCase();
  if      (s == "IDLE")     state = ST_IDLE;
  else if (s == "WORKING")  state = ST_WORKING;
  else if (s == "INTERACT") state = ST_INTERACT;
  else { server.send(400, "text/plain", "BAD_STATE\n"); return; }
  server.send(200, "text/plain", String("OK ") + stateName(state) + "\n");
}

void handleStatusText() {
  server.send(200, "text/plain", String(stateName(state)) + "\n");
}

void handleReboot() {
  server.send(200, "application/json", "{\"ok\":true}");
  delay(300);
  ESP.restart();
}

void handleFactoryReset() {
  setDefaults();
  saveConfig();
  server.send(200, "application/json", "{\"ok\":true}");
  delay(300);
  ESP.restart();
}

void handleNotFound() {
  if (apMode) {
    server.sendHeader("Location",
                      String("http://") + WiFi.softAPIP().toString() + "/", true);
    server.send(302, "text/plain", "");
    return;
  }
  server.send(404, "text/plain", "NOT_FOUND\n");
}

void setupRoutes() {
  server.on("/",           HTTP_GET,  handleRoot);
  server.on("/api/status", HTTP_GET,  handleApiStatus);
  server.on("/api/config", HTTP_GET,  handleApiConfigGet);
  server.on("/api/config", HTTP_POST, handleApiConfigPost);
  server.on("/api/scan",   HTTP_GET,  handleApiScan);
  server.on("/api/reboot", HTTP_POST, handleReboot);
  server.on("/api/reset",  HTTP_POST, handleFactoryReset);
  server.on("/state",      HTTP_GET,  handleSetState);
  server.on("/status",     HTTP_GET,  handleStatusText);
  server.onNotFound(handleNotFound);
}

/* ===================== WiFi roaming ===================== */
void startAP() {
  apMode = true;
  activeSlot = -1;
  WiFi.mode(WIFI_AP);
  WiFi.softAP(AP_SSID);
  dns.setErrorReplyCode(DNSReplyCode::NoError);
  dns.start(53, "*", WiFi.softAPIP());
  Serial.printf("AP: %s -> http://%s/\n",
                AP_SSID, WiFi.softAPIP().toString().c_str());
}

// Thu 1 slot. Tra ve true neu noi duoc.
bool tryConnect(uint8_t slot, uint16_t timeoutMs) {
  if (!cfg.net[slot].ssid[0]) return false;
  Serial.printf("thu slot %u \"%s\"", slot, cfg.net[slot].ssid);

  WiFi.begin(cfg.net[slot].ssid, cfg.net[slot].pass);
  unsigned long t0 = millis();
  while (millis() - t0 < timeoutMs) {
    if (WiFi.status() == WL_CONNECTED) {
      Serial.printf(" OK %s\n", WiFi.localIP().toString().c_str());
      activeSlot = slot;
      return true;
    }
    // nhay xanh duong trong luc cho
    writeAll(0, 0, ((millis() / 250) % 2) ? 30 : 0);
    delay(60);
  }
  Serial.println(" that bai");
  WiFi.disconnect();
  return false;
}

/* Quet xem mang nao dang co mat, uu tien mang manh nhat.
   Nho vay mang qua cong ty khong phai cau hinh lai.          */
bool connectBest() {
  apMode = false;
  WiFi.mode(WIFI_STA);
  WiFi.hostname(cfg.host);
  WiFi.persistent(false);
  WiFi.setAutoReconnect(true);

  if (netCount() == 0) return false;

  int8_t order[NET_SLOTS];
  int32_t rssi[NET_SLOTS];
  uint8_t cnt = 0;

  int found = WiFi.scanNetworks();
  for (uint8_t s = 0; s < NET_SLOTS; s++) {
    if (!cfg.net[s].ssid[0]) continue;
    int32_t best = -32768;
    for (int i = 0; i < found; i++) {
      if (WiFi.SSID(i) == cfg.net[s].ssid && WiFi.RSSI(i) > best) best = WiFi.RSSI(i);
    }
    if (best > -32768) { order[cnt] = s; rssi[cnt] = best; cnt++; }
  }

  // sap xep giam dan theo RSSI (n <= 3, insertion sort la du)
  for (uint8_t i = 1; i < cnt; i++) {
    int8_t  ks = order[i];
    int32_t kr = rssi[i];
    int8_t  j  = i - 1;
    while (j >= 0 && rssi[j] < kr) {
      order[j + 1] = order[j]; rssi[j + 1] = rssi[j]; j--;
    }
    order[j + 1] = ks; rssi[j + 1] = kr;
  }

  for (uint8_t i = 0; i < cnt; i++) {
    Serial.printf("thay \"%s\" (%d dBm)\n", cfg.net[order[i]].ssid, (int)rssi[i]);
    if (tryConnect(order[i], 12000)) break;
  }

  // khong thay mang nao da luu -> thu het cac slot (SSID an)
  if (WiFi.status() != WL_CONNECTED) {
    for (uint8_t s = 0; s < NET_SLOTS; s++) {
      bool tried = false;
      for (uint8_t i = 0; i < cnt; i++) if (order[i] == (int8_t)s) tried = true;
      if (!tried && tryConnect(s, 8000)) break;
    }
  }

  if (WiFi.status() != WL_CONNECTED) return false;

  if (MDNS.begin(cfg.host)) {
    MDNS.addService("http", "tcp", 80);
    Serial.printf("mdns: http://%s.local/\n", cfg.host);
  }
  discoBegin();
  return true;
}

/* ===================== setup / loop ===================== */
void setup() {
  Serial.begin(115200);
  delay(200);
  Serial.println("\n=== cc-reminder (roaming) ===");

  loadConfig();
  strip.Begin();
  strip.Show();
  writeAll(0, 0, 30);

  if (!connectBest()) startAP();

  setupRoutes();
  server.begin();
  state = ST_IDLE;
  Serial.println("san sang");
}

void loop() {
  server.handleClient();

  if (apMode) {
    dns.processNextRequest();
    static unsigned long t = 0;
    if (millis() - t > 20) {
      t = millis();
      writeAll(0, 0, (uint8_t)(60 * pulseK(1600, 0.10f)));
    }
    return;
  }

  MDNS.update();
  discoLoop();
  renderLed();

  /* Mat WiFi qua lau -> quet lai tu dau. Day la co che cho phep
     rut o nha cam o cong ty ma khong phai lam gi.               */
  static unsigned long lostAt = 0;
  if (WiFi.status() != WL_CONNECTED) {
    if (lostAt == 0) {
      lostAt = millis();
      Serial.println("mat wifi");
    } else if (millis() - lostAt > RECONNECT_MS) {
      Serial.println("quet lai cac mang da luu");
      lostAt = 0;
      if (!connectBest()) startAP();
    }
  } else {
    lostAt = 0;
  }
}

/* ===================== trang web =====================
   Phan duoi day do tools/embed_page.py sinh ra tu firmware/web/page.html.
   SUA HTML O FILE DO roi chay: python3 tools/embed_page.py
   Dung sua truc tiep trong day - se bi ghi de.                          */
/* ---8<--- PAGE BEGIN --- */
const char PAGE_HTML[] PROGMEM = R"CCR(
<!doctype html>
<html lang="vi"><head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>cc-reminder</title>
<style>
:root{--bg:#15171c;--card:#1e2128;--line:#2c313b;--tx:#e6e8ec;--dim:#8b93a1;--ac:#4a9eff}
*{box-sizing:border-box}
body{margin:0;padding:16px;background:var(--bg);color:var(--tx);
font:15px/1.5 -apple-system,BlinkMacSystemFont,"Segoe UI",Roboto,sans-serif;
max-width:520px;margin:0 auto}
h1{font-size:19px;margin:8px 0 4px}
h1 span{color:var(--dim);font-weight:400;font-size:14px}
h2{font-size:14px;text-transform:uppercase;letter-spacing:.06em;color:var(--dim);
margin:0 0 12px}
.card{background:var(--card);border:1px solid var(--line);border-radius:10px;
padding:14px;margin:12px 0}
.row{display:flex;align-items:center;gap:10px;margin:10px 0}
.row label{flex:1;min-width:0}
input,select{background:#12141a;color:var(--tx);border:1px solid var(--line);
border-radius:7px;padding:8px 10px;font-size:15px;font-family:inherit}
input[type=text],input[type=password]{width:100%}
input[type=number]{width:78px}
input[type=color]{width:46px;height:34px;padding:2px;cursor:pointer}
input[type=range]{flex:2;accent-color:var(--ac)}
input[type=checkbox]{width:18px;height:18px;accent-color:var(--ac)}
button{background:#2a2f39;color:var(--tx);border:1px solid var(--line);
border-radius:7px;padding:9px 14px;font-size:14px;font-family:inherit;
cursor:pointer}
button:active{transform:translateY(1px)}
button.pri{background:var(--ac);border-color:var(--ac);color:#08111d;font-weight:600}
button.dgr{color:#ff8080}
.btns{display:flex;gap:8px;flex-wrap:wrap}
.st{display:grid;grid-template-columns:auto 1fr;gap:4px 14px;font-size:14px}
.st b{color:var(--dim);font-weight:400}
.mono{font-variant-numeric:tabular-nums}
.dot{width:10px;height:10px;border-radius:50%;display:inline-block;
margin-right:6px;vertical-align:middle}
.hint{color:var(--dim);font-size:13px;margin-top:8px}
#msg{position:fixed;left:0;right:0;bottom:0;padding:12px;text-align:center;
background:var(--ac);color:#08111d;font-weight:600;transform:translateY(100%);
transition:transform .2s}
#msg.on{transform:none}
</style></head><body>
<h1>cc-reminder <span id="hn"></span></h1>
<div class="card">
<h2>Trạng thái</h2>
<div class="st">
<b>Đèn</b><span id="s-state">—</span>
<b>WiFi</b><span id="s-wifi">—</span>
<b>IP</b><span id="s-ip" class="mono">—</span>
<b>Tín hiệu</b><span id="s-rssi" class="mono">—</span>
<b>Uptime</b><span id="s-up" class="mono">—</span>
</div>
</div>
<div class="card">
<h2>Thử đèn</h2>
<div class="btns">
<button onclick="setState('IDLE')">IDLE</button>
<button onclick="setState('WORKING')">WORKING</button>
<button onclick="setState('INTERACT')">INTERACT</button>
</div>
<div class="hint">Bấm để xem màu ngay trên đèn thật.</div>
</div>
<div class="card">
<h2>LED</h2>
<div class="row">
<label for="bright">Độ sáng <span id="bv" class="mono"></span></label>
<input type="range" id="bright" min="1" max="255">
</div>
<div class="row">
<label for="pixels">Số LED</label>
<input type="number" id="pixels" min="1" max="24">
</div>
<div class="row">
<label for="order">Thứ tự màu</label>
<select id="order">
<option value="0">GRB — mặc định</option>
<option value="1">RGB — nếu đỏ ra xanh lá</option>
</select>
</div>
<div id="states"></div>
<div class="hint">Bỏ tick “nhịp” để đèn sáng đứng. Chu kỳ tính bằng ms.</div>
</div>
<div class="card">
<h2>WiFi</h2>
<div class="row">
<label>Nhớ tối đa 3 mạng — nhà, công ty, hotspot</label>
<button onclick="scan()" id="btn-scan">Quét</button>
</div>
<datalist id="nets"></datalist>
<div id="wifis"></div>
<div class="row"><label for="host">Hostname</label></div>
<div class="row"><input type="text" id="host" autocomplete="off"></div>
<div class="hint">Bật nguồn ở đâu, thiết bị tự quét và chọn mạng có tín hiệu
mạnh nhất trong danh sách. Xoá trống ô SSID để bỏ mạng đó.</div>
</div>
<div class="card">
<div class="btns">
<button class="pri" onclick="save(0)">Lưu</button>
<button onclick="save(1)">Lưu &amp; khởi động lại</button>
<button class="dgr" onclick="factoryReset()">Xoá cấu hình</button>
</div>
</div>
<div id="msg"></div>
<script>
var NAMES = ['IDLE', 'WORKING', 'INTERACT'];
function el(id) { return document.getElementById(id); }
function toast(t) {
var m = el('msg');
m.textContent = t;
m.classList.add('on');
setTimeout(function () { m.classList.remove('on'); }, 2200);
}
function buildWifis() {
var h = '';
for (var i = 0; i < 3; i++) {
h += '<div class="row"><label for="ssid' + i + '" style="flex:0 0 58px">#' +
(i + 1) + '</label>' +
'<input type="text" id="ssid' + i + '" list="nets" autocomplete="off" ' +
'placeholder="SSID"></div>' +
'<div class="row"><label style="flex:0 0 58px"></label>' +
'<input type="password" id="pass' + i + '" ' +
'placeholder="mật khẩu"></div>';
}
el('wifis').innerHTML = h;
}
function buildStates() {
var h = '';
for (var i = 0; i < 3; i++) {
h += '<div class="row">' +
'<label for="c' + i + '">' + NAMES[i] + '</label>' +
'<input type="color" id="c' + i + '">' +
'<label for="p' + i + '" style="flex:0 0 auto">nhịp</label>' +
'<input type="checkbox" id="p' + i + '">' +
'<input type="number" id="t' + i + '" min="200" max="10000" step="100">' +
'</div>';
}
el('states').innerHTML = h;
}
function loadConfig() {
fetch('/api/config').then(function (r) { return r.json(); }).then(function (c) {
for (var k = 0; k < 3; k++) {
el('ssid' + k).value = c.nets[k].ssid;
el('pass' + k).placeholder = c.nets[k].saved ? 'đã lưu — để trống là giữ nguyên'
: 'mật khẩu';
}
el('host').value   = c.host;
el('pixels').value = c.pixels;
el('bright').value = c.bright;
el('bv').textContent = c.bright;
el('order').value  = c.order;
for (var i = 0; i < 3; i++) {
el('c' + i).value   = c.col[i];
el('p' + i).checked = c.pulse[i] === 1;
el('t' + i).value   = c.period[i];
}
}).catch(function () { toast('Không đọc được cấu hình'); });
