silpdev/cc-reminder-esp8266/firmware/src/main.cpp
}
function loadStatus() {
fetch('/api/status').then(function (r) { return r.json(); }).then(function (s) {
var col = { IDLE: '#22c55e', WORKING: '#f59e0b', INTERACT: '#ef4444' };
el('s-state').innerHTML =
'<span class="dot" style="background:' + (col[s.state] || '#888') + '"></span>' + s.state;
el('s-wifi').textContent = s.ap ? 'Chế độ AP (chưa cấu hình)'
: ((s.ssid || '—') + (s.slot >= 0 ? '  (#' + (s.slot + 1) + ')' : ''));
el('s-ip').textContent   = s.ip;
el('s-rssi').textContent = s.ap ? '—' : (s.rssi + ' dBm');
var u = s.uptime, d = Math.floor(u / 86400), h = Math.floor(u % 86400 / 3600),
m = Math.floor(u % 3600 / 60);
el('s-up').textContent = (d ? d + 'd ' : '') + h + 'h ' + m + 'm';
el('hn').textContent = s.host ? s.host + '.local' : '';
}).catch(function () {});
}
function setState(s) {
fetch('/state?s=' + s).then(function () { loadStatus(); });
}
function scan() {
var b = el('btn-scan');
b.textContent = 'Đang quét…';
b.disabled = true;
fetch('/api/scan').then(function (r) { return r.json(); }).then(function (list) {
list.sort(function (a, b2) { return b2.rssi - a.rssi; });
var h = '';
for (var i = 0; i < list.length; i++) {
h += '<option value="' + list[i].ssid.replace(/"/g, '&quot;') + '">' +
list[i].rssi + ' dBm</option>';
}
el('nets').innerHTML = h;
toast('Thấy ' + list.length + ' mạng — bấm vào ô SSID để chọn');
}).catch(function () {
toast('Quét thất bại');
}).then(function () {
b.textContent = 'Quét';
b.disabled = false;
});
}
function save(thenReboot) {
var d = new URLSearchParams();
for (var k = 0; k < 3; k++) {
d.append('ssid' + k, el('ssid' + k).value);
d.append('pass' + k, el('pass' + k).value);
}
d.append('host',   el('host').value);
d.append('pixels', el('pixels').value);
d.append('bright', el('bright').value);
d.append('order',  el('order').value);
for (var i = 0; i < 3; i++) {
d.append('c' + i, el('c' + i).value);
d.append('p' + i, el('p' + i).checked ? '1' : '0');
d.append('t' + i, el('t' + i).value);
}
fetch('/api/config', {
method: 'POST',
headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
body: d.toString()
}).then(function (r) { return r.json(); }).then(function (res) {
for (var k = 0; k < 3; k++) el('pass' + k).value = '';
if (thenReboot || res.reboot) {
toast('Đã lưu — đang khởi động lại…');
fetch('/api/reboot', { method: 'POST' });
} else {
toast('Đã lưu, áp dụng ngay');
}
}).catch(function () { toast('Lưu thất bại'); });
}
function factoryReset() {
if (!confirm('Xoá toàn bộ cấu hình, kể cả WiFi. Thiết bị sẽ quay về chế độ AP. Tiếp tục?')) return;
fetch('/api/reset', { method: 'POST' }).then(function () {
toast('Đã xoá — đang khởi động lại…');
});
}
buildWifis();
buildStates();
loadConfig();
loadStatus();
el('bright').addEventListener('input', function () { el('bv').textContent = this.value; });
setInterval(loadStatus, 3000);
</script>
</body></html>
)CCR";
/* ---8<--- PAGE END --- */
